Repository: Insekta/insekta-web
Catalog: insekta/locale/*/LC_MESSAGES/django.po
Languages: de_de

source: Home
de_de: Start

source: Overview
de_de: Übersicht

source: Hello, %(username)s!
de_de: Hallo, %(username)s!

source: Username
de_de: Benutzername

source: Password
de_de: Passwort

source: Sign in
de_de: Einloggen

source: Certificates
de_de: Zertifikate

source: My questions
de_de: Meine Fragen

source: Configure help
de_de: Hilfe konfigurieren

source: Registration
de_de: Registrierung

source: First name
de_de: Vorname

source: Last name
de_de: Nachname

source: Confirm password
de_de: Passwort bestätigen

source: Invitation code
de_de: Einladungscode

source: Register
de_de: Registrieren

source: Invalid invitation code.
de_de: Ungültiger Einladungscode.

source: Account created successfully.
de_de: Account wurde erfolgreich erstellt.

source: Courses
de_de: Kurse

source: Help others
de_de: Anderen helfen

source: Please enable JavaScript. Don't worry, we won't set your CPU on fire with snowflakes on this page.
de_de: Bitte aktiviere JavaScript. Keine Sorge, wir werden deine CPU nicht mit Schneeflocken auf dieser Seite zum brennen bringen.

source: <strong>Hooray!</strong> Someone answered one of <a href="%(my_questions_url)s">your questions</a>.
de_de: <strong>Hurra!</strong> Jemand hat eine <a href="%(my_questions_url)s">deiner Fragen</a> beantwortet.

source: Welcome to Insekta
de_de: Willkommen bei Insekta

source: <p>Want to learn something about IT security? <a href="%(register_url)s">register for an account</a>.</p>
de_de: <p>Du möchtest etwas über IT-Sicherheit lernen? <a href="%(register_url)s">Registriere einen Account</a>. </p>

source: Learn
de_de: Lernen

source: At Insekta you get comprehensible explanations to various topics of IT security. Topics might include visualisations and interactive elements to make understanding easier.
de_de: Bei Insekta findest du verständliche Erklärungen zu verschiedenen Themen der IT-Sicherheit. Die Themen enthalten manchmal sogar Visualisierungen und interaktive Elemente, um das Verständnis zu verbessern.

# Taking exercises
source: Exercise
de_de: Üben

source: Nearly every topic contains useful exercises you can use to check your knowledge. Ranging from simple multiple choice questions to programming exercises.
de_de: Fast jedes Thema enthält nützliche Übungen, um dein Wissen zu prüfen. Sie reichen von einfachen Multiple-Choice-Fragen bis hin zu Programmieraufgaben.

source: Get help
de_de: Hilfe bekommen

source: In case you are stuck with some topic you can always ask for help. Other students who already solved exercises from this topic can help you.
de_de: Falls du bei einem Thema nicht weiterkommst, kannst du jederzeit um Hilfe bitten. Andere Studierende, die die Übungen des Themas bereits gelöst haben, können dir helfen.

source: More about ethics
de_de: Mehr über Ethik

source: Ethics in computer security and computer science in general
de_de: Ethik in der IT-Security und Informatik im Allgemeinen

source: <p>We still have to collect some arguments and resources for further reading.</p>
de_de: <p>Wir sammeln noch ein paar Argumente und weiterführende Literatur zum Vertiefen.</p>

source: Some links
de_de: Einige Links

source: <ul> <li> <a href="http://cpsr.org/">Computer professionals for social responsibility</a> — Global organisation which promotes the responsible use of computer technology </li> <li> <a href="http://fiff.de/">Forum InformatikInnen für Frieden und gesellschaftliche Verantwortung</a> — German association with similar topics as the CPSR. </li> <li> <a href="https://ccc.de/de/hackerethik">Hacker ethics</a> on the website of the <a href="https://ccc.de/">Chaos Computer Club</a> </li> </ul>
de_de: <ul> <li> <a href="http://cpsr.org/">Computer professionals for social responsibility</a> — Globale Organisation, die für den verantwortungsvollen Umgang mit IT wirbt </li> <li> <a href="http://fiff.de/">Forum InformatikInnen für Frieden und gesellschaftliche Verantwortung</a> — Deutscher Verein mit ähnlichen Themen wie die CPSR. </li> <li> <a href="https://ccc.de/de/hackerethik">Hackerethik</a> auf der Website des <a href="https://ccc.de/">Chaos Computer Club</a> </li> </ul>

source: Take me back.
de_de: Bring mich zurück

source: Ethics in computer security
de_de: Ethik in der IT-Sicherheit

source: I understand what you want to say and I agree.
de_de: Ich verstehe, was ihr sagen wollt und stimme dem zu.

source: Create certificate
de_de: Zertifikat erstellen

source: <p> To create a Certificate Signing Request (CSR) you have to create a private key first. You can use the following command to create an RSA private key with a key size of 2048 bit: </p> <p> <kbd>openssl genrsa -out client.key 2048</kbd> </p> <p> You should now have a file called "client.key". <strong>Keep this file safe and don't share it with anyone!</strong> Otherwise your account is compromised. If this happens, you should <a href="%(revoke_link)s">revoke your certificate</a> immediately and create a new private key. </p> <p> Next step is to create a the CSR itself. A CSR is used to ask a Certificate Authority (CA) to issue a certificate for you. The CSR basically contains the public key counterpart of your private key and some information about you. It is signed with your private key. Since a CSR contains no sensitive information, it is safe to share. In this case you will share it with us (the CA) to get a certificate from us. </p> <p> You can use the following command to create a CSR. It will ask for some information. You can type anything (or just hit <kbd>enter</kbd>), we will ignore it anyway: </p> <p> <kbd>openssl req -new -key client.key -out client.csr</kbd> </p> <p>Congratulation! You should now have a file named "client.csr" containing the CSR. Paste the content of that file into the following text box to obtain your certificate. </p>
de_de: <p> Um einen Certificate Signing Request (CSR) zu erstellen, musst du zunächst einen privaten Schlüssel anlegen. Du kannst den folgenden Befehl nutzen, der einen privaten RSA-Schlüssel mit einer Schlüsselgröße von 2048 Bit erstellt: </p> <p> <kbd>openssl genrsa -out client.key 2048</kbd> </p> <p> Du solltest nun eine Datei mit dem Namen "client.key" haben. <strong>Verwahre diese Datei sicher und teile sie mit niemanden!</strong> Sonst ist dein Account kompromittiert. Sollte dies passieren, solltest du sofort dein <a href="%(revoke_link)s"> dein Zertifikate zurückziehen</a> und einen neuen privaten Schlüssel erstellen.</p> <p> Im nächsten Schritt wird das CSR selbst erstellt. Ein CSR wird dazu benutzt, um eine Certificate Authority (CA) um Ausstellung eines Zertifikats zu bitten. Das CSR beinhaltet in Prinzip das öffentliche Gegenstück zu deinem privaten Schlüssel und ein paar Informationen über dich. Es ist mit deinem privaten Schlüssel signiert. Da ein CSR keine geheimen Informationen enthält, kann es sicher mit anderen geteilt werden. In diesem Fall wirst du es mit uns teilen (der CA) um von uns ein Zertifikat zu erhalten.</p> <p> Du kannst den folgenden Befehl nutzen, um ein CSR zu erstellen. Es wird dich nach einigen Informationen fragen. Du kannst irgendetwas eingeben (oder einfach immer <kbd>Enter</kbd> drücken), wir werden die Angaben sowieso ignorieren:</p> <p> <kbd>openssl req -new -key client.key -out client.csr</kbd> </p> <p>Glückwunsch! Du solltest nun eine Datei mit dem Namen "client.csr" mit dem CSR haben. Kopiere den Inhalt diese Datei in das folgende Eingabefeld, um dein Zertifikat zu erhalten:</p>

source: CSR (pem encoded)
de_de: CSR (PEM-kodiert)

source: Cancel
de_de: Abbrechen

source: Your certificates
de_de: Deine Zertifikate

source: You have a valid certificate. You should now go and <a href="%(vpn_link)s">configure VPN</a>
de_de: Du besitzt ein gültiges Zertifikat und solltest nun dein <a href="%(vpn_link)s">VPN konfigurieren</a>

source: Expire date
de_de: Ablaufdatum

source: You don't have any certificates yet. If you want to connect to the VPN you have create one.
de_de: Du hast noch keine Zertifikate. Wenn du dich zum VPN verbinden möchtest, musst du eines erstellen.

source: Submit CSR (for experts)
de_de: CSR einreichen (für Experten)

source: Revoke certificate
de_de: Zertifikate zurückziehen

source: Do you really want to revoke the certificate with the fingerprint <strong>%(fingerprint)s</strong>?
de_de: Möchtest du wirklich das Zertifikat mit dem Fingerprint <strong>%(fingerprint)s</strong> zurückziehen?

source: Yes, revoke it
de_de: Ja, zurückziehen

source: No, please not
de_de: Nein, bitte nicht

source: Course:
de_de: Kurs:

source: You will see help requests for the following topics:
de_de: Du siehst Hilfe-Anfragen zu den folgenden Themen:

source: Topics
de_de: Themen

source: Challenges
de_de: Herausforderungen

source: Save
de_de: Speichern

source: Open questions
de_de: Offene Fragen

source: You will only see questions for topics you have chosen to help. <a href="%(configure_help_url)s">Change my help preferences.</a>
de_de: Du siehst hier nur Fragen zu Themen, bei denen zu dich bereit erklärt hast zu helfen. <a href="%(configure_help_url)s">Meine Hilfe-Themen ändern.</a>

source: Title
de_de: Titel

source: Asked at
de_de: Gefragt am

source: Asked by
de_de: Gefragt von

source: Course
de_de: Kurs

source: Topic
de_de: Thema

source: New
de_de: Neu

source: There are no open questions for your help preferences.
de_de: Es gibt keine offenen Fragen für die Themen, bei denen du hilfst.

source: Is solved
de_de: Geklärt

source: new answer
de_de: neue Antwort

source: Yes
de_de: Ja

source: No
de_de: Nein

source: You have asked no questions. Choose a topic to ask a question.
de_de: Du hast noch keine Fragen gestellt. Wähle ein Thema um eine Frage zu stellen.

source: New question
de_de: Neue Frage

source: Your question
de_de: Deine Frage

source: Preview
de_de: Vorschau

source: The following HTML is allowed:
de_de: Das folgende HTML ist erlaubt:

source: Additionally you can use \( inline math \) or \[ block math \].
de_de: Zusätzlich kannst du \( Inline-Mathe \) oder \[ Block-Mathe \] verwenden.

source: Ask question
de_de: Frage stellen

source: Questions for "%(scenario_title)s"
de_de: Fragen zu "%(scenario_title)s"

source: Questions
de_de: Fragen

source: View all my questions
de_de: Zeige alle meine Fragen

source: There are no questions to this topic yet.
de_de: Es gibt noch keine Fragen zu diesem Thema.

source: My open questions
de_de: Meine offenen Fragen

source: Other open questions
de_de: Andere offene Fragen

source: Solved questions
de_de: Geklärte Fragen

source: Author
de_de: Autor

source: This question is solved.
de_de: Diese Frage ist geklärt.

source: Did you get a good answer for your question? If yes, please mark your question as solved.
de_de: Hast du eine gute Antwort auf deine Frage bekommen? Wenn ja, markiere deine Frage bitte als geklärt.

source: Mark as solved
de_de: Als geklärt markieren

# In response to an answer
source: Your query
de_de: Deine Rückfrage

source: Your answer
de_de: Deine Antwort

source: This question is already solved, you can't answer anymore.
de_de: Diese Frage ist bereits geklärt, du kannst nicht mehr darauf antworten.

# to answer (verb)
source: Answer
de_de: Antworten

source: Question was saved.
de_de: Die Frage wurde gespeichert.

source: Supported topics/challenges configured successfully.
de_de: Hilfsangebote für Themen/Herausforderungen erfolgreich gesetzt.

source: Thank you for helping!
de_de: Danke für das Helfen!

source: Exercise: {}
de_de: Aufgabe: {}

source: Exercise
de_de: Aufgabe

source: Congratulation. Your answer is correct.
de_de: Glückwunsch. Deine Antwort ist richtig.

source: Sorry, your answer is incorrect.
de_de: Entschuldige, deine Antwort ist falsch.

source: Solve exercise
de_de: Aufgabe lösen

source: <strong>Here be dragons.</strong> You have to solve an exercise to uncover more content.
de_de: <strong>Hier sind Drachen.</strong> Du musst eine Aufgabe lösen, um mehr Inhalt anzuzeigen.

source: Show hint
de_de: Zeige Hinweis

source: Registration: %(title)s
de_de: Anmeldung: %(title)s

source: Register for this course
de_de: Zu diesem Kurs anmelden

source: This course is currently not offered.
de_de: Dieser Kurs wird zurzeit nicht angeboten.

source: Comment
de_de: Kommentar

source: Your comment
de_de: Dein Kommentar

# to comment (verb)
source: Comment
de_de: Kommentieren

source: There are currently no courses.
de_de: Es gibt zurzeit keine Kurse.

source: There are no challenges for this course.
de_de: Es existieren keine Herausforderungen für diesen Kurs.

source: There are no topics for this course.
de_de: Es existieren keine Themen für diesen Kurs.

source: Challenge
de_de: Herausforderung

source: Solved exercises
de_de: Gelöste Aufgaben

source: Options for "%(title)s"
de_de: Optionen zu "%(title)s"

source: Options for "<a href="%(scenario_link)s">%(title)s</a>"
de_de: Optionen zu "<a href="%(scenario_link)s">%(title)s</a>"

source: Reset exercises
de_de: Aufgaben zurücksetzen

source: Your notes
de_de: Deine Notizen

source: Notes
de_de: Notizen

source: Comments:
de_de: Kommentare:

source: off
de_de: aus

source: on
de_de: an

source: Options
de_de: Optionen

source: Saved.
de_de: Gespeichert.

source: User comments
de_de: Benutzerkommentare

source: This topic contains explanations of attack techniques from a black hat's perspective. We would like to remind you of the <a href="%(ethics_url)s">hacker ethics</a>.
de_de: Dieses Thema beinhaltet Erklärungen von Angriffstechniken aus der Sicht eines "black hat". Wir möchten dich daher an die <a href="%(ethics_url)s">Hackerethik</a> erinnern.

source: Destroy virtual machines
de_de: Virtuelle Machinen zerstören

source: Start virtual machines
de_de: Virtuelle Maschinen starten

source: Virtual machines are running. If you close this page they will be destroyed automatically at <span id="expire_time">%(expire_time)s</span>, but you can manually destroy them if you like.
de_de: Die virtuellen Maschinen laufen. Wenn du diese Seite schließt, werden die automatisch um <span id="expire_time">%(expire_time)s</span> zerstört. Du kannst sie aber, wenn du magst, auch manuell zerstören.

source: This topic makes use of virtual machines. In order to solve some exercises you might have to start them.
de_de: Dieses Thema nutzt virtuelle Maschinen. Um einige Aufgaben zu lösen, musst du diese möglicherweise starten.

source: You are connected the VPN and your IP inside the VPN is %(vpn_ip)s.
de_de: Du bist zum VPN verbunden, deine IP innerhalb des VPNs lautet: %(vpn_ip)s.

source: The virtual machines should be reachable.
de_de: Die virtuellen Maschinen sollten erreichbar sein.

source: The virtual machines should be reachable once they are started.
de_de: Die virtuellen Maschinen sollten erreichbar sein, sobald sie gestartet wurden.

source: You are not connected to the <a href="%(vpn_url)s">VPN</a>, which is required to reach the virtual machines. If you are connected, refresh <a href="%(this_page_url)s">this page</a>.
de_de: Du bist nicht mit dem <a href="%(vpn_url)s">VPN</a> verbunden. Dies ist aber Voraussetzung, um die virtuellen Maschinen zu erreichen. Wenn du verbunden bist, lade <a href="%(this_page_url)s">diese Seite</a> neu.

source: Do you want to help others with this topic?
de_de: Möchtest du anderen bei diesem Thema helfen?

source: Course: %(title)s
de_de: Kurs: %(title)s

source: Challenges provide no explanations and are therefore not suitable to learn new topics. Anyway, feel free to try them.
de_de: Herausforderungen enthalten keine Erklärungen und sind daher nicht zum Lernen neuer Themen geeignet. Wie auch immer, probiere sie ruhig aus.

source: The exercises were reset. You can now solve them again.
de_de: Die Aufgaben wurden zurückgesetzt. Du kannst sie nun erneut lösen.

source: Download OpenVPN configuration
de_de: OpenVPN-Konfiguration herunterladen

source: You have no valid certificates. Please create one first to be able to download your VPN configuration.
de_de: Du hast keine gültigen Zertifikate. Bitte erstelle zunäcst eins um deine VPN-Konfiguration herunterladen zu können.
